src/Documents/РасходноКассовыйОрдер/РасходноКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
	<name>РасходноКассовыйОрдер</name>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСКассирами</registerRecords>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСАгенствами</registerRecords>
	<registerRecords>AccumulationRegister.ДвижениеДенежныхСредств</registerRecords>
	<attributes>
		<name>Операция</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</attributes>
	<attributes>
		<name>Поставщик</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</attributes>
	<attributes>
		<name>Касса</name>
		<type>
			<types>CatalogRef.Касса</types>
		</type>
	</attributes>
	<attributes>
		<name>БанковскийСчет</name>
		<type>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</attributes>
	<attributes>
		<name>СуммаОплаты</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>Валюта</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</attributes>
	<attributes>
		<name>ВидОплаты</name>
		<type>
			<types>EnumRef.ВидОплаты</types>
		</type>
	</attributes>
	<attributes>
		<name>ПроцентАГН</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>ПроцентСуб</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>НужнаКонвертация</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<attributes>
		<name>КассаКонвертации</name>
		<type>
			<types>CatalogRef.Касса</types>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</attributes>
	<attributes>
		<name>Курс</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>3</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>СуммаКонвертации</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>ВалютаКонвертации</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</attributes>
</mdclass:Document>

src/AccumulationRegisters/ДвижениеДенежныхСредств/ДвижениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ДвижениеДенежныхСредств</name>
	<resources>
		<name>Сумма</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<dimensions>
		<name>БанковскийСчетКасса</name>
		<type>
			<types>CatalogRef.Касса</types>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Покупатель</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Поставщик</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Валюта</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ХозяйственнаяОперация</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ВзаиморасчетыСАгенствами/ВзаиморасчетыСАгенствами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ВзаиморасчетыСАгенствами</name>
	<resources>
		<name>СуммаЗадолженностиАГН</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>10</precision>
			</numberQualifiers>
		</type>
	</resources>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</attributes>
	<dimensions>
		<name>Авиакомпания</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Билет</name>
		<type>
			<types>CatalogRef.Билет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ВалютаВзаиморасчетов</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/Enums/ХозОперации/ХозОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ХозОперации</name>
	<enumValues>
		<name>ОплатаПоставщику</name>
	</enumValues>
	<enumValues>
		<name>ПрочийРасход</name>
	</enumValues>
	<enumValues>
		<name>ПоступлениеОтКлиента</name>
	</enumValues>
	<enumValues>
		<name>ВозвратПокупателю</name>
	</enumValues>
	<enumValues>
		<name>Штраф</name>
	</enumValues>
	<enumValues>
		<name>ПродажаБилета</name>
	</enumValues>
	<enumValues>
		<name>Конвертация</name>
	</enumValues>
</mdclass:Enum>

src/Documents/РасходноКассовыйОрдер/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если НужнаКонвертация Тогда
	СуммаПлатежаЗначение=СуммаКонвертации;
	ВалютаПерем=ВалютаКонвертации;
Иначе
	СуммаПлатежаЗначение=СуммаОплаты;
	ВалютаПерем=Валюта;
КонецЕсли;
	#Область ДДС
	Если НужнаКонвертация Тогда		
	//------Оприходование суммы от конвертации---------------------	
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	ДП=Движения.ДвижениеДенежныхСредств.Добавить();
	ДП.ВидДвижения=ВидДвиженияНакопления.Приход;
	ДП.БанковскийСчетКасса=КассаКонвертации;
	ДП.ХозяйственнаяОперация=Перечисления.ХозОперации.Конвертация;
  ДП.Период=Дата;
  ДП.Валюта=ВалютаПерем;
	ДП.Сумма=СуммаКонвертации;
	//-------------------------------------------------------------
	ДС=Движения.ДвижениеДенежныхСредств.Добавить();
	ДС.ВидДвижения=ВидДвиженияНакопления.Расход;
	Если Касса<>Неопределено Тогда
		ДС.БанковскийСчетКасса=КассаКонвертации;
	Иначе
		ДС.БанковскийСчетКасса=КассаКонвертации;
	КонецЕсли;
	Если Поставщик<>Неопределено Тогда
		ДС.ХозяйственнаяОперация=Перечисления.ХозОперации.ОплатаПоставщику;
	Иначе
		ДС.ХозяйственнаяОперация=Перечисления.ХозОперации.ПрочийРасход;
	КонецЕсли;
	ДС.Поставщик=Поставщик;
	ДС.Период=Дата;
	ДС.Сумма=СуммаПлатежаЗначение;
	ДС.Валюта=ВалютаПерем;		
	Иначе
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	ДС=Движения.ДвижениеДенежныхСредств.Добавить();
	ДС.ВидДвижения=ВидДвиженияНакопления.Расход;
	Если Касса<>Неопределено Тогда
		ДС.БанковскийСчетКасса=Касса;
	Иначе
		ДС.БанковскийСчетКасса=БанковскийСчет;
	КонецЕсли;
	Если Поставщик<>Неопределено Тогда
		ДС.ХозяйственнаяОперация=Перечисления.ХозОперации.ОплатаПоставщику;
	Иначе
		ДС.ХозяйственнаяОперация=Перечисления.ХозОперации.ПрочийРасход;
	КонецЕсли;
	ДС.Поставщик=Поставщик;
	ДС.Период=Дата;
	ДС.Сумма=СуммаПлатежаЗначение;
	ДС.ВалютаВзаиморасчетов=ВалютаПерем;
	КонецЕсли;
	#КонецОбласти
	
	#Область ВзаиморасчетыСАгенствами
	Движения.ВзаиморасчетыСАгенствами.Записывать=Истина;	
	ТаблицаДвижений=МодульПроведенияНаСервере.ВозвратДетализацииПоВзаиморасчетам(Поставщик,ВалютаПерем,Дата);	
Остаток=0;
	Если ТаблицаДвижений.Количество()>0 Тогда	
		//-------- Метод распределения суммы по ФИФО	
	Для каждого СтрТаб из ТаблицаДвижений Цикл
		Если СуммаПлатежаЗначение>0 Тогда	
			Движение=Движения.ВзаиморасчетыСАгенствами.Добавить();
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Остаток=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженностиАГНКонечныйОстаток;
			Если Остаток>0 Тогда
			Движение.СуммаЗадолженностиАГН=СуммаПлатежаЗначение-Остаток;
		   Иначе
			Движение.СуммаЗадолженностиАГН=СуммаПлатежаЗначение;
			КонецЕсли;
			СуммаПлатежаЗначение=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженностиАГНКонечныйОстаток;
			Движение.Билет=СтрТаб.Билет;
			Движение.ВалютаВзаиморасчетов=ВалютаПерем;
			Движение.Период=Дата;
			Движение.Авиакомпания=Поставщик;
			Движение.ВидОперации=Перечисления.ХозОперации.ОплатаПоставщику;
			Движение.Регистратор=Ссылка;
			КонецЕсли;
		КонецЦикла;
	Иначе
			Движение=Движения.ВзаиморасчетыСАгенствами.Добавить();
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Движение.СуммаЗадолженностиАГН=СуммаОплаты;
			Движение.ВалютаВзаиморасчетов=ВалютаПерем;
			Движение.Период=Дата;
			Движение.Авиакомпания=Поставщик;
			Движение.ВидОперации=Перечисления.ХозОперации.ОплатаПоставщику;
	КонецЕсли;		
	#КонецОбласти
КонецПроцедуры
